; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x6-y6-t3-k333-l333-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f 
        shape0 shape1 shape2 
        key0-0 key0-1 key0-2 
        key1-0 key1-1 key1-2 
        key2-0 key2-1 key2-2 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(shape shape0)
(shape shape1)
(shape shape2)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(open f0-0f)
(open f1-0f)
(open f2-0f)
(open f3-0f)
(open f4-0f)
(open f0-1f)
(open f1-1f)
(open f3-1f)
(open f4-1f)
(open f0-2f)
(open f1-2f)
(open f2-2f)
(open f3-2f)
(open f4-2f)
(open f5-2f)
(open f1-3f)
(open f2-3f)
(open f3-3f)
(open f4-3f)
(open f5-3f)
(open f2-4f)
(open f3-4f)
(open f4-4f)
(open f5-4f)
(open f1-5f)
(open f3-5f)
(open f4-5f)
(locked f1-4f)
(lock-shape f1-4f shape0)
(locked f2-5f)
(lock-shape f2-5f shape0)
(locked f0-5f)
(lock-shape f0-5f shape0)
(locked f5-1f)
(lock-shape f5-1f shape1)
(locked f5-5f)
(lock-shape f5-5f shape1)
(locked f0-3f)
(lock-shape f0-3f shape1)
(locked f2-1f)
(lock-shape f2-1f shape2)
(locked f0-4f)
(lock-shape f0-4f shape2)
(locked f5-0f)
(lock-shape f5-0f shape2)
(at key0-0 f0-4f)
(at key0-1 f1-1f)
(at key0-2 f4-2f)
(at key1-0 f4-1f)
(at key1-1 f4-0f)
(at key1-2 f3-5f)
(at key2-0 f3-4f)
(at key2-1 f2-3f)
(at key2-2 f3-1f)
(at-robot f1-3f)
)
(:goal
(and
(at key0-1 f1-2f)
(at key1-0 f3-1f)
(at key1-2 f0-3f)
(at key2-2 f1-5f)
)
)
)

; plan
1. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 0 of 4
2. (pickup f2-3f key2-1)
   deleted: (at key2-1 f2-3f) (arm-empty)
   added: (holding key2-1)
   goals met: 0 of 4
3. (move f2-3f f1-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 4
4. (move f1-3f f1-2f)
   deleted: (at-robot f1-3f)
   added: (at-robot f1-2f)
   goals met: 0 of 4
5. (move f1-2f f1-1f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-1f)
   goals met: 0 of 4
6. (unlock f1-1f f2-1f key2-1 shape2)
   deleted: (locked f2-1f)
   added: (open f2-1f)
   goals met: 0 of 4
7. (pickup-and-loose f1-1f key0-1 key2-1)
   deleted: (holding key2-1) (at key0-1 f1-1f)
   added: (holding key0-1) (at key2-1 f1-1f)
   goals met: 0 of 4
8. (move f1-1f f1-2f)
   deleted: (at-robot f1-1f)
   added: (at-robot f1-2f)
   goals met: 0 of 4
9. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 0 of 4
10. (unlock f1-3f f1-4f key0-1 shape0)
   deleted: (locked f1-4f)
   added: (open f1-4f)
   goals met: 0 of 4
11. (move f1-3f f1-2f)
   deleted: (at-robot f1-3f)
   added: (at-robot f1-2f)
   goals met: 0 of 4
12. (putdown f1-2f key0-1)
   deleted: (holding key0-1)
   added: (arm-empty) (at key0-1 f1-2f)
   goals met: 1 of 4
13. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 1 of 4
14. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 1 of 4
15. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 1 of 4
16. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 1 of 4
17. (move f3-4f f3-5f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-5f)
   goals met: 1 of 4
18. (pickup f3-5f key1-2)
   deleted: (at key1-2 f3-5f) (arm-empty)
   added: (holding key1-2)
   goals met: 1 of 4
19. (move f3-5f f3-4f)
   deleted: (at-robot f3-5f)
   added: (at-robot f3-4f)
   goals met: 1 of 4
20. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 1 of 4
21. (move f2-4f f2-3f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-3f)
   goals met: 1 of 4
22. (move f2-3f f1-3f)
   deleted: (at-robot f2-3f)
   added: (at-robot f1-3f)
   goals met: 1 of 4
23. (unlock f1-3f f0-3f key1-2 shape1)
   deleted: (locked f0-3f)
   added: (open f0-3f)
   goals met: 1 of 4
24. (move f1-3f f0-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f0-3f)
   goals met: 1 of 4
25. (putdown f0-3f key1-2)
   deleted: (holding key1-2)
   added: (arm-empty) (at key1-2 f0-3f)
   goals met: 2 of 4
26. (move f0-3f f1-3f)
   deleted: (at-robot f0-3f)
   added: (at-robot f1-3f)
   goals met: 2 of 4
27. (move f1-3f f2-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f2-3f)
   goals met: 2 of 4
28. (move f2-3f f2-2f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-2f)
   goals met: 2 of 4
29. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 2 of 4
30. (move f3-2f f3-1f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-1f)
   goals met: 2 of 4
31. (pickup f3-1f key2-2)
   deleted: (at key2-2 f3-1f) (arm-empty)
   added: (holding key2-2)
   goals met: 2 of 4
32. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 2 of 4
33. (pickup-and-loose f4-1f key1-0 key2-2)
   deleted: (holding key2-2) (at key1-0 f4-1f)
   added: (holding key1-0) (at key2-2 f4-1f)
   goals met: 2 of 4
34. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 2 of 4
35. (putdown f3-1f key1-0)
   deleted: (holding key1-0)
   added: (arm-empty) (at key1-0 f3-1f)
   goals met: 3 of 4
36. (move f3-1f f4-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 3 of 4
37. (pickup f4-1f key2-2)
   deleted: (at key2-2 f4-1f) (arm-empty)
   added: (holding key2-2)
   goals met: 3 of 4
38. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 3 of 4
39. (move f4-2f f3-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f3-2f)
   goals met: 3 of 4
40. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 3 of 4
41. (move f3-3f f2-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f2-3f)
   goals met: 3 of 4
42. (move f2-3f f2-4f)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-4f)
   goals met: 3 of 4
43. (move f2-4f f1-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f1-4f)
   goals met: 3 of 4
44. (move f1-4f f1-5f)
   deleted: (at-robot f1-4f)
   added: (at-robot f1-5f)
   goals met: 3 of 4
45. (putdown f1-5f key2-2)
   deleted: (holding key2-2)
   added: (arm-empty) (at key2-2 f1-5f)
   goals met: 4 of 4
